## Formas de Seleção

In [3]:
import pandas as pd

In [4]:
'l1 l2 l3 l4'.split()

['l1', 'l2', 'l3', 'l4']

In [5]:
data = [(1,2,3,4),
        (5,6,7,8,),
        (8,10,11,12),
        (13,14,15,16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [14]:
# selecionando duas colunas
df[['c1', 'c3']]

    c1  c3
l1   1   3
l2   5   7
l3   8  11
l4  13  15

In [15]:
# selecionando linhas pelo index
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [17]:
# selecionando linhas pelo index e colunas
df[2:][['c2','c4']]

    c2  c4
l3  10  12
l4  14  16

In [19]:
# selecionando linhas pelo nome
df.loc['l3']
# cria uma series com os valores da linha 'l3'

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [20]:
# selecionando linhas pelo nome
df.loc[['l3', 'l1']]
# cria um DataFrame com os valores das linhas 'l3' e 'l1'

    c1  c2  c3  c4
l3   8  10  11  12
l1   1   2   3   4

In [23]:
# valor específico: linha 'l1' e coluna 'c2'
df.loc['l1', 'c2']

2

In [24]:
# valor específico: linha 'l1' e coluna 'c2' com index (.iloc)
df.iloc[0, 1]

2

In [25]:
# linhas 'l3' e 'l1' - colunas 'c4' e 'c1'
df.loc[['l3', 'l1'], ['c4', 'c1']]

    c4  c1
l3  12   8
l1   4   1

In [26]:
# mesmo com '.iloc'
df.iloc[[2, 0], [3, 0]]

    c4  c1
l3  12   8
l1   4   1